tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "wez/wezterm"
brew "bat"
brew "ghq"
brew "lazygit"
brew "ripgrep"
brew "tmux"
brew "shellcheck"
brew "shfmt"
cask "wezterm"
if OS.mac?
    brew "go"
    brew "ncurses"
    brew "neovim"
    brew "reattach-to-user-namespace"
    brew "tree"
    cask "clipy"
    cask "keycastr"
    cask "rectangle"
elsif OS.linux?
    brew "zsh"
end
