tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "wez/wezterm"
brew "bat"
brew "ghq"
brew "lazygit"
brew "ripgrep"
brew "tmux"
brew "shellcheck"
brew "shfmt"
brew "direnv"
brew "rclone"
brew "ffmpeg"
brew "delta"
brew "fd"
cask "wezterm"
brew "jq"
brew "yq"
brew "mise"
if OS.mac?
    brew "go"
    brew "ncurses"
    brew "neovim"
    brew "gawk"
    brew "gnu-sed"
    brew "findutils"
    brew "reattach-to-user-namespace"
    brew "tree"
    brew "libyaml" # Rubyのインストールで必要
    brew "terminal-notifier"
    cask "karabiner-elements"
    cask "keycastr"
    cask "rectangle"
    cask "raycast"
    cask "font-hackgen"
    cask "font-hackgen-nerd"
elsif OS.linux?
    brew "zsh"
end
